'''Задача 2: Напишите программу, которая найдёт 
произведение пар чисел списка. Парой считаем первый 
и последний элемент, второй и предпоследний и т.д.
Пример:
- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
'''
list = [2, 3, 4, 5, 6]
list2 = []
for i in range(int(len(list)/2 + 0.5)):
    list2.append(list[i] * list[-1-i])
print(f'{list} => {list2}')
