'''Задача 1: Вычислить число 
c заданной точностью d
Пример:
- при $d = 0.001, π = 3.141.$    
$10^{-1} ≤ d ≤10^{-10}$
'''
input_d = input("Введите число для заданной точности числа Пи: ")
d = int(len(input_d)-2)
i = 1
pi = 0
for i in range(1, 1000000):
    pi = pi+4*((-1)**(i+1))/(2*i-1)
# print(f'При d = {input_d}, π = {round(pi, d)}') # в этом случае раунд округляет в примере до: π = 3.142
print(f'При d = {input_d}, π = {(int(pi*10**d))/10**d}')